Repository: VovaMobile/trainingNvdaCommands
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, tr

source: Description:
tr: Tanım:

source: Training Keyboard Commands
ar: التدرب على أوامر Nvda
tr: Klavye Komutları Eğitimi

source: Display training keyboard Commands game dialog.
tr: Klavye Komutları Eğitimi oyun iletişim ekranını görüntüle.

source: Training Nvda Commands
tr: NVDA Komutları Eğitimi

source: Your Score: 0
ar: رصيدك الآن هو : صفر
tr: Puanın: 0

source: Choose Option
ar: انتقي خياراً لو سمحت :
tr: Seçenek belirle

source: Desktop layout commands
ar: أوامر سطح المكتب
tr: Masaüstü komutları

source: Laptop layout commands
ar: أوامر الحاسوب المحمول
tr: Dizüstü komutları

source: Choose keyboard layout to train commands
ar: إختر نوع الأوامر التي تريد أن تتدرب عليها
tr: Komut eğitimi için klavye düzeni seç

source: Ok
ar: موافق
tr: Tamam

source: Begin Play
ar: هيا نبدأ اللعبة
tr: Oyuna Başla

source: Exit
ar: خروج
tr: çık

source: Do you want to save remaining questions from this round; so that you can resume them later?
ar: هل تريد حفظ الأسءلة المتبقية من هذه الجولة; حتى تتمكن من إكمالها لاحقاً؟
tr: Daha sonra kaldığın yerden devam edebilmek için; bu turu kaydetmek istiyor musun?

source: Save Game
ar: حفظ اللعبة
tr: Oyunu kaydet

source: Your Score: {}/{}
ar: الرصيد هو : {}/{}
tr: Puanın: {}/{}

source: Wrong answer; No lose, go on.
ar: الإجابة خطأ; ليس هناك خسارة, إستمر في اللعبة.
tr: Yanlış cevap; Kaybetmek yok, devam et.

source: Error Message
ar: رسالةْ خطأ
tr: Hata mesajı

source: Your Score: {}
ar: الرصيد هو : {}
tr: Puanın: {}

source: Congratulations; you have answered all questions and won; see you in another round or game.
ar: تهانينا; لقد أجبت جميع الأسءلة و فُزت; إلى اللقاء في جولة أو لعبة أخرى.
tr: Tebrikler; tüm soruları cevapladın ve kazandın; başka bir turda veya oyunda görüşürüz.

source: End Of Game
ar: نهايةْ اللعبة
tr: Oyunun Sonu

source: Choose layout and play again
ar: إختر نوع الأوامر التي تريد أن تتدرب عليها, و ابدأ مِن جديد
tr: Düzen seç ve tekrar oyna

source: Desktop layout
ar: وضعيةْ سطح المكتب
tr: Masaüstü düzeni

source: Laptop layout
ar: وضعيةْ الحاسوب المحمول
tr: Dizüstü düzeni

source: Questions preserved of previous round of same layout found, Do you want to resume the previous round?
ar: هناك أسءلة من نفس النمط محفوظة من جولة سابقة; هل تريد إستءناف الجولة السابقة؟
tr: Bu düzen için daha önce kaydedilmiş bir tur bulundu, Kayıtlı turdan devam etmek ister misin?

source: Resume Game
ar: إستءناف اللعبة
tr: Oyuna devam et

source: Welcome To training nvda commands like game; We will ask you NVDA {} commands like questions; and you have to choose the right answer from the available options; Let us then begin!
ar: مرحباً بكم في لعبةْ التدرب على أوامر Nvda; سنطرح عليكم أسءلة تتعلق باختصارات Nvda بالنسبةِ لِ{}; و عليكم إختيار الجواب الصحيح من الإحتمالات الموجودة; هيا بنا نبدأ!
tr: NVDA için Klavye komutları eğitimi oyununa Hoşgeldin.; Bu oyunda NVDA klavye komutlarını soracağız; Her soruda sunulan cevap seçeneklerinden doğru olanı seçmelisin.; O halde başlayalım!

source: Welcome
ar: مرحباً
tr: Hoş geldin

source: Your score: {}/{}
ar: الرصيد هو: {}/{}
tr: Puanın: {}/{}

source: Training Keyboards Commands
ar: التدرب على أوامر Nvda

source: This addon allows you to train NVDA commands in game like way, for either desktop or laptop layout mode. For every commands and it's description, you have to choose the right keys or answer specific to it. And if exiting before the end, you can save the remaining questions to resume them in later time. In order to use the addon, you have to assign a gesture to it via NVDAmenu>preferences>inputGestures>trainingKeyboardCommands.
ar: هذه الإضافة تتيح لك التدرب على أوامر Nvda , بالنسبة للحاسوب المكتبي أو المحمول; عند عرض الوظيفة و شرحها, عليك إختيار المفاتيح أو الأوامر المتعلقة بها; و إذا أردت الخروج من اللعبة قبل النهاية, يمكنك حفظ الأسءلة المتبقية لاستءنافها لاحقاً; لاستخدام الإضافة, عليك عمل إختصار لها من خلال قاءمةْ Nvda >تفضيلات>تخصيص إختصارات Nvda >التدرب على أوامر Nvda.
